neosoultech/bioimpedance_msp430_test/main.c
void max30002_reset(void) { // resets max30002
    max30002_write_reg(MAX_REG_SW_RST, 0x000000);
    __delay_cycles(100000); // 0.1 s delay
}

void max30002_synch(void) { // Begins new BIOZ operations on clock edge. Clears FIFO memory
    max30002_write_reg(MAX_REG_SYNCH, 0x000000);
    __delay_cycles(10000); // 10 ms delay
}

void max30002_fifo_reset(void) { // Begins new BIOZ operations by resetting FIFO. Operations of BIOZ active circuitry not impacted. (No settling/transients)
    max30002_write_reg(MAX_REG_FIFO_RST, 0x000000);
    __delay_cycles(10000); // 10ms delay
}

uint32_t max30002_read_status(void) { // how to determine why MAX interrupted
    return max30002_read_reg(MAX_REG_STATUS);
}

uint32_t max30002_read_info(void) { // gives interface/part/revision information
    return max30002_read_reg(MAX_REG_INFO);
}

uint32_t max30002_read_fifo(void) { // reads BIOZ FIFO at register 0x23. Uses same 32-clock read sequence.
    return max30002_read_reg(MAX_REG_FIFO);
}

int32_t bioz_parse(uint32_t raw) { // helper function to parse bioZ data. Bits [2:0] are status bits and bits [23:4] are the data.
    int32_t data = (int32_t)(raw >> 4)  & 0xFFFFF; // extract 20-bit signed BioZ sample
    if (data & 0x80000) // if bit 19 is 1 (negative)
        data |= 0xFFF00000; // sign-extend 20-bit value to 32-bit signed int
    return (int32_t) data; // returning the parsed data bits
}

void max30002_configure_bioz_once(void) { // configures the MAX30002 for bioimpedance sensing. Only needs to occur once
    uint32_t bmux;

    max30002_reset(); // reset to known state
    (void)max30002_read_status(); // dummy transaction. Can't do INFO as first command after reset.
    __delay_cycles(10000); // 10 ms delay

    max30002_write_reg(MAX_REG_EN_INT, MAX_CFG_EN_INT_START); // Configure INTB: allow BioZ FIFO interrupt & overflow to drive INTB, use open drain INTB output
    max30002_write_reg(MAX_REG_MNGR_INT, MAX_CFG_MNGR_INT_START); // Configure interrupt manager so interrupt if >=1 BioZ sample in FIFO, and interrupt flag clears auto.
    max30002_write_reg(MAX_REG_CNFG_BIOZ, MAX_CFG_CNFG_BIOZ_START); // Configure BioZ channel: 32sps, 8.192Khz, low noise, 10V/V gain, midrange current magnitude

    bmux = max30002_read_reg(MAX_REG_CNFG_BMUX); // read BMUX config
    bmux &= ~(MAX_BMUX_OPENP_BIT | MAX_BMUX_OPENN_BIT); // clear OPENP AND OPENN so BIP and BIN connected to BioZ channel
    max30002_write_reg(MAX_REG_CNFG_BMUX, bmux); // Connected BIP & BIN to BioZ channel

    max30002_write_reg(MAX_REG_CNFG_GEN, MAX_CFG_CNFG_GEN_START); // Enable BioZ & internal lead biasing. Requires EN_BIOZ to be asserted same time (done)
    __delay_cycles(100000); // 0.1s startup
}

void bioz_prepare_selected_path(void) { // helper function to get ready for BioZ sample
    max_flag = 0; // clear stale interrupt flag
    __delay_cycles(50000); // Allow selected electrode path/contact to settle.
    max30002_fifo_reset(); // clear old samples
    max30002_synch(); // restart bioZ sample timing & alignment
    // Let BioZ samples settle after restart.
    __delay_cycles(1000000);        // 1.0 s

}

int32_t max30002_collect_bioz_average(uint16_t sample_goal) // takes average of n x 2 samples; if the n first trials and the n second trials are not similar, it will discard the outlier.
{
    uint32_t status;
    uint32_t raw;
    uint8_t tag;
    int32_t bioz;

    int64_t sum1 = 0;
    int64_t sum2 = 0;

    uint16_t count1 = 0;
    uint16_t count2 = 0;
    uint16_t discard_count = 0;

    int32_t avg1;
    int32_t avg2;
    int32_t diff;

    while (count2 < sample_goal) {
        if (!max_flag) {
            continue;
        }

        max_flag = 0;
        status = max30002_read_status();

        if (status & MAX_STATUS_BOVF) { // if FIFO overflow happened, clear FIFO and keep trying
            debug_bovf_count++;
            max30002_fifo_reset();
            max30002_synch();

            discard_count = 0; // restart discard after overflow
            count1 = 0;
            count2 = 0;
            sum1 = 0;
            sum2 = 0;

            continue;
        }

        while ((status & MAX_STATUS_BINT) && (count2 < sample_goal)) {
            raw = max30002_read_fifo(); // getting raw data from MAX
            tag = raw & 0x07; // get FIFO overflow tag

            if (tag == 0x07) { // FIFO overflow tag
                debug_bovf_count++;
                max30002_fifo_reset();
                max30002_synch();

                discard_count = 0; // restart discard after overflow
                count1 = 0;
                count2 = 0;
                sum1 = 0;
                sum2 = 0;

                break;
            }

            if (tag == 0x06) { // if FIFO empty, try again
                break;
            }

            if (tag == 0x00 || tag == 0x02) { // valid sample or valid EOF
                bioz = bioz_parse(raw); // parse data
                debug_bioz = bioz; // debug bioz
                sample_count++; // for debug

                if (discard_count < BIOZ_DISCARD_SAMPLES) { // Throw away early settling samples
                    discard_count++;
                }
                else if (count1 < sample_goal) { // first settled block
                    sum1 += bioz; // sum added
                    count1++; // counter incremented
                }
                else { // second settled block
                    sum2 += bioz; // sum added
                    count2++; // counter incremented
                }
            }

            if (tag == 0x01 || tag == 0x03) { // over/under range
                bioz = bioz_parse(raw);
                debug_bioz = bioz;
            }

            if (tag == 0x02 || tag == 0x03) { // EOF tags
                break;
            }

            status = max30002_read_status();
        }
    }

    if (count1 == 0 || count2 == 0) { // error if no count
        return 0;
    }

    avg1 = (int32_t)(sum1 / count1); // averaging the first 16 samples
    avg2 = (int32_t)(sum2 / count2); // averaging the second 16 samples

