neosoultech/bioimpedance_msp430_test/main.c
    diff = avg1 - avg2; // compare first settled block to second settled block
    if (diff < 0) {
        diff = -diff; // take ||
    }

    if (diff > BIOZ_BLOCK_MISMATCH_LIMIT) { // first block likely still settling or contact artifact if difference is over 500
        return avg2; // use later block only
    }

    return (avg1 + avg2) / 2; // blocks agree, use both
}

uint16_t append_str(uint8_t *buf, uint16_t idx, uint16_t max, const char *s) // appends a normal null-terminated C string into byte buffer
{
    while (*s && idx < max) { // copy until end of buffer full
        buf[idx++] = (uint8_t)(*s++); // copy character by character into buffer
    }
    return idx; // return updated buffer index.
}

uint16_t append_int32(uint8_t *buf, uint16_t idx, uint16_t max, int32_t value) // signed 32-bit integer into readable ASCII. i.e 10 to +10
{
    char temp[12]; // temp storage for digits
    uint8_t i = 0; // how many digits stored in temp
    uint8_t j;

    if (value < 0) { // if neg num
        if (idx < max) { // if there is room in buffer
            buf[idx++] = '-'; // append minus sign
        }
        value = -value; // get positive val to extract digits
    }
    else {
        if (idx < max) { // if value positive
            buf[idx++] = '+'; // append + sign
        }
    }

    if (value == 0) { // if zero
        if (idx < max) {
            buf[idx++] = '0'; // append zero
        }
        return idx; // return updated index
    }

    while (value > 0 && i < sizeof(temp)) { // extract digits from R to L
        temp[i++] = (char)('0' + (value % 10)); // LSD stored as ASCII
        value /= 10; // drop LSD
    }

    for (j = 0; j < i; j++) { // copy digits in reverse order so num reads right
        if (idx < max) {
            buf[idx++] = temp[i - 1 - j];
        }
    }

    return idx; // return updated index in buffer
}

uint16_t append_uint32_no_sign(uint8_t *buf, uint16_t idx, uint16_t max, uint32_t value)     // Appends an unsigned integer as readable ASCII text. Example: value = 6285 becomes "6285". This is used for Target and Reference because those do not need plus signs.
{
    char temp[12]; // Temporary reversed digit storage
    uint8_t i = 0; // Counts how many digits were stored in temp
    uint8_t j; // Loop index used when copying digits back in correct order
    if (value == 0) { // Special case because digit extraction loop would not run for zero
        if (idx < max) { // Make sure there is buffer room
            buf[idx++] = '0'; // Append ASCII zero
        }
        return idx; // Return updated index
    }
    while (value > 0 && i < sizeof(temp)) { // Extract digits from right to left
        temp[i++] = (char)('0' + (value % 10)); // Store current least significant digit as ASCII
        value /= 10; // Drop the least significant digit
    }
    for (j = 0; j < i; j++) { // Copy digits back in reverse order so number reads correctly
        if (idx < max) { // Make sure there is buffer room
            buf[idx++] = temp[i - 1 - j]; // Append next digit in correct order
        }
    }
    return idx; // Return updated buffer index
}

uint16_t append_signed_x10(uint8_t *buf, uint16_t idx, uint16_t max, int32_t value_x10) // append signed fixed pt num with a decimal place. i.e. value_x10 = 55 goes to +5.5
{
    int32_t whole; // whole num part
    int32_t frac; // fraction
    char temp[12]; // temp digit storage reversed
    uint8_t i = 0;
    uint8_t j;

    if (value_x10 < 0) { // negative
        if (idx < max) {
            buf[idx++] = '-'; // append -
        }
        value_x10 = -value_x10;
    }
    else {
        if (idx < max) { // positive
            buf[idx++] = '+'; // append positive
        }
    }

    whole = value_x10 / 10; // whole num part
    frac = value_x10 % 10; // remainder gives decimal digit

    if (whole == 0) { // if whole num is zero
        if (idx < max) {
            buf[idx++] = '0'; // append zero before decimal pt
        }
    }
    else { // if whole num is nonzero
        while (whole > 0 && i < sizeof(temp)) { // extract whole num digits from R to L
            temp[i++] = (char)('0' + (whole % 10));
            whole /= 10;
        }

        for (j = 0; j < i; j++) { // copy digits back in correct order
            if (idx < max) {
                buf[idx++] = temp[i - 1 - j];
            }
        }
    }

    if (idx < max) { // ensure buffer room
        buf[idx++] = '.'; // decimal pt append
    }

    if (idx < max) {
        buf[idx++] = (uint8_t)('0' + frac); // append one decial digit
    }

    return idx;
}

uint16_t build_bioz_ndef_text_msg(uint8_t *out, uint16_t max_len, int32_t target_raw, int32_t reference_raw) // builds NDEF text record phone can read from ST25 mailbox
{
    uint8_t text[150]; // buffer for text payload
    uint16_t ti = 0; // current index into text buf
    uint16_t i; // loop for copy text into NDEF
    uint16_t payload_len;
    uint16_t total_len; // NDEF payload length
    int32_t diff; // raw diff b/w target and ref
    int32_t percent; // percent diff, int
    int32_t zdiff_x10; // approx ohm difference multiplied by 10

    diff = target_raw - reference_raw; // calc raw target vs ref diff

    if (reference_raw != 0) { // avoid div by 0 if reference failed
        percent = (int32_t)(((int64_t)diff * 100) / reference_raw); // percent diff = 100 * diff / reference
    }
    else {
        percent = 0; // percent is 0 if reference is 0
    }

    zdiff_x10 = (int32_t)(((int64_t)diff * 900) / 15946); // approx ohm diff x10 using 1k ohm resistor calibration: raw * 90 / 15946, then x10.

    ti = append_str(text, ti, sizeof(text), "BIOZ CHECK: ");
    ti = append_int32(text, ti, sizeof(text), percent);
    ti = append_str(text, ti, sizeof(text), "% target-vs-ref\n\n");

    ti = append_str(text, ti, sizeof(text), "Difference: ");
    ti = append_int32(text, ti, sizeof(text), diff);
    ti = append_str(text, ti, sizeof(text), " raw\n");

    ti = append_str(text, ti, sizeof(text), "Approx diff: ");
    ti = append_signed_x10(text, ti, sizeof(text), zdiff_x10);
    ti = append_str(text, ti, sizeof(text), " ohm\n\n");

    ti = append_str(text, ti, sizeof(text), "Target: "); // Label target raw value line
    ti = append_uint32_no_sign(text, ti, sizeof(text), (uint32_t)target_raw); // Append target raw value without plus sign
    ti = append_str(text, ti, sizeof(text), " raw\n"); // Add units and new line

    ti = append_str(text, ti, sizeof(text), "Reference: "); // Label reference raw value line
    ti = append_uint32_no_sign(text, ti, sizeof(text), (uint32_t)reference_raw); // Append reference raw value without plus sign
    ti = append_str(text, ti, sizeof(text), " raw"); // Add units without final newline

