neosoultech/bioimpedance_msp430_test/main.c
    payload_len = 3 + ti; // NDEF text payload has status byte and 2 byte lang code plus text length
    total_len = 4 + payload_len; // NDEF short record header is 4 bytes before payload

    if (total_len > max_len || payload_len > 255) { // check output buf size and NDEF short record payload lim
        return 0; // fail if message didn't fit
    }

    out[0] = 0xD1; // NDEF header
    out[1] = 0x01; // type length 1 byte
    out[2] = (uint8_t)payload_len; // payload length
    out[3] = 'T'; // Text type
    out[4] = 0x02; // text status byte
    out[5] = 'e';
    out[6] = 'n';

    for (i = 0; i < ti; i++) { // copy human readable text into final NDEF payload
        out[7 + i] = text[i]; // final payload text starts after NDEF header, statys byte, lang code
    }

    return total_len; // return total # bytes to write to ST25DV mailbox
}

// LED STATUS INDICATORS
void led_blink_measuring (void) { // blinking LED = measurement
    LED_TOGGLE();
    __delay_cycles (200000); // 0.2 seconds at 1MHz
}
void led_pulse_transmission (void) { // short pulse = successful event
    LED_ON();
    __delay_cycles(300000); // 0.3 second pulse
    LED_OFF();
}
void led_idle(void) { // LED off = idle/sleeping
    LED_OFF();
}
void error_handler (void) { // ensures LED is solid during error
    LED_ON();

    while(1); // LED stays permanently on with error
}

// EXP430 buttons
void button_s1_init(void) { // helper function to initialize buttons on EXP430FR2433 dev kit
    // S1 = P2.3
    // active-low buttons w/ internal pullups

    P2SEL0 &= ~(BUTTON_S1_BIT); // GPIO mode
    P2SEL1 &= ~(BUTTON_S1_BIT); // GPIO mode
    P2DIR &= ~(BUTTON_S1_BIT); // // S1 as input
    P2REN |= (BUTTON_S1_BIT); // turn on resistors
    P2OUT |= (BUTTON_S1_BIT); // turn on pullups
    P2IE &= ~(BUTTON_S1_BIT); // turn off hardware interrupts
    P2IFG &= ~(BUTTON_S1_BIT); // clear any interrupt flags
}
void wait_for_s1_press(void) { // blocks execution until button S1 fully pressed & released
    while (P2IN & BUTTON_S1_BIT); // BUTTON_S1_BIT is 0 if pressed
    __delay_cycles(50000); // 50ms debounce
    while (!(P2IN & BUTTON_S1_BIT));
    __delay_cycles(50000);
}
